In [38]:
import pandas as pd, matplotlib as plt, numpy as np

In [39]:
df = pd.read_csv("D:/Degree/codes/Python/DataSet/Perrin Freres monthly champagne sales millions.csv")
df.head()

     Month  Perrin Freres monthly champagne sales millions ?64-?72
0  1964-01                                             2815.0
1  1964-02                                             2672.0
2  1964-03                                             2755.0
3  1964-04                                             2721.0
4  1964-05                                             2946.0

In [40]:
df.columns=["Month","Sales"]
df.head()

     Month   Sales
0  1964-01  2815.0
1  1964-02  2672.0
2  1964-03  2755.0
3  1964-04  2721.0
4  1964-05  2946.0

In [41]:
df.isnull().sum()

Month    1
Sales    2
dtype: int64

In [42]:
df.shape

(107, 2)

In [43]:
df.dropna(inplace=True)

In [44]:
df.shape

(105, 2)

In [45]:
df.tail()

       Month   Sales
100  1972-05  4618.0
101  1972-06  5312.0
102  1972-07  4298.0
103  1972-08  1413.0
104  1972-09  5877.0

In [46]:
df.shape

(105, 2)

In [47]:
df.xs('Month', axis=1)

0      1964-01
1      1964-02
2      1964-03
3      1964-04
4      1964-05
        ...
100    1972-05
101    1972-06
102    1972-07
103    1972-08
104    1972-09
Name: Month, Length: 105, dtype: object

In [48]:
df['Month'] = pd.to_datetime(df['Month'])

In [49]:
df.set_index('Month',inplace=True)

In [50]:
df.head(10)

             Sales
Month
1964-01-01  2815.0
1964-02-01  2672.0
1964-03-01  2755.0
1964-04-01  2721.0
1964-05-01  2946.0
1964-06-01  3036.0
1964-07-01  2282.0
1964-08-01  2212.0
1964-09-01  2922.0
1964-10-01  4301.0